# Эти задачи необходимо решить используя регулярные выражения!

# Задача - 1
# Запросите у пользователя имя, фамилию, email. Теперь необходимо совершить проверки, имя и фамилия должны иметь заглавные первые буквы.
# email - не должен иметь заглавных букв и должен быть в формате: текст в нижнем регистре, допускается нижнее подчеркивание и цифры, потом @, потом текст, допускаются цифры, точка, ru или org или com.
# Например:
# Пупкин василий - неверно указано имя, te$T@test.net - неверно указан email (спецсимвол, заглавная буква, .net), te_4_st@test.com - верно указан.
# name, surname = input("Введите свои имя и фамилию: ").split()
# email = input("Введите свой email: ")

import re

name = input("Введите свое имя: ").strip()
surname = input("Введите свою фамилию: ").strip()
email = input("Введите свой email: ").strip()
if re.match(r'[А-ЯA-Z]', name) is None:
    print("Имя должно начинаться с большой буквы.")

if re.match(r'[А-ЯA-Z]', surname) is None:
    print("Фамилия должна начинаться с большой буквы.")

if re.match(r'[a-z0-9_]+@[a-z0-9]+\.(ru|com|org)', email) is None:
    print("Неверный формат Email.")

# Задача - 2:
# Вам дан текст:

some_str = '''
Мороз и солнце; день чудесный!
Еще ты дремлешь, друг прелестный —
Пора, красавица, проснись:
Открой сомкнуты негой взоры
Навстречу северной Авроры,
Звездою севера явись!
Вечор, ты помнишь, вьюга злилась,
На мутном небе мгла носилась;
Луна, как бледное пятно,
Сквозь тучи мрачные желтела,
И ты печальная сидела —
А нынче... погляди в окно:
Под голубыми небесами
Великолепными коврами,
Блестя на солнце, снег лежит;
Прозрачный лес один чернеет,
И ель сквозь иней зеленеет,
И речка подо льдом блестит.
Вся комната янтарным блеском
Озарена. Веселым треском
Трещит затопленная печь.
Приятно думать у лежанки.
Но знаешь: не велеть ли в санки
Кобылку бурую запречь?
Скользя по утреннему снегу,
Друг милый, предадимся бегу
Нетерпеливого коня
И навестим поля пустые,
Леса, недавно столь густые,
И берег, милый для меня.'''

# Необходимо с помощью регулярных выражений определить есть ли в тексте подряд
# более одной точки, при любом исходе сообщите результат пользователю!

import re

x = []
x = re.findall(r'\.{2,}', some_str)
print("В тексте встречается более одной точки подряд.") if x else print("В тексте нет нескольких точек подряд.")
